---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyAttachedTypeWarn
source: html/0dd5d29d-4d09-73d4-2cc5-7a6b81f7fec1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyAttachedTypeWarn Property

Cannot copy attached detail group type without copying the model group type it refers to.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyAttachedTypeWarn { get; }
```